# Data Cleaning Practice Task

In [1]:
import pandas as pd
from sklearn.preprocessing import MinMaxScaler

### Load the Dataset

In [2]:
df = pd.read_csv('raw_data.csv')
df

       Name   Age   Salary
0     Alice  25.0  50000.0
1       Bob   NaN  60000.0
2   Charlie  30.0      NaN
3     David  22.0  52000.0
4       Eve  28.0  58000.0
5     Alice  25.0  50000.0
6     Frank   NaN  61000.0
7     Grace  27.0      NaN
8    Hannah  35.0  70000.0
9       Ivy  29.0  65000.0
10     Jack  24.0  48000.0
11    Grace  27.0      NaN

### Remove Missing Values

In [3]:
df.isna().sum()

Name      0
Age       2
Salary    3
dtype: int64

There are 2 missing values in `Age` and 3 in `Salary`. We want to remove the missing values next.

In [4]:
df = df.dropna()
df

      Name   Age   Salary
0    Alice  25.0  50000.0
3    David  22.0  52000.0
4      Eve  28.0  58000.0
5    Alice  25.0  50000.0
8   Hannah  35.0  70000.0
9      Ivy  29.0  65000.0
10    Jack  24.0  48000.0

Since we removed 5 rows that contain missing values, there are only 7 people left in our dataset.

### Check for Duplicates

In [5]:
df.duplicated()

0     False
3     False
4     False
5      True
8     False
9     False
10    False
dtype: bool

The one row that we see as `True` indicates the row that is duplicated. We want to remove this in the next step.

In [6]:
df.loc[df.duplicated()] # row 5 is duplicated

    Name   Age   Salary
5  Alice  25.0  50000.0

In [7]:
df_no_duplicates = df.drop_duplicates() # drop duplicates
df_no_duplicates

      Name   Age   Salary
0    Alice  25.0  50000.0
3    David  22.0  52000.0
4      Eve  28.0  58000.0
8   Hannah  35.0  70000.0
9      Ivy  29.0  65000.0
10    Jack  24.0  48000.0

### Type Conversion

Now, we want to convert the types of the columns (`Age` and `Salary` from `float` -> `int`)

In [8]:
df_no_duplicates['Age'] = df_no_duplicates['Age'].astype(dtype=int)
df_no_duplicates['Salary'] = df_no_duplicates['Salary'].astype(dtype=int)

df_no_duplicates

/var/folders/mf/gw2nsdmn2qjcnj0gsj8sd1200000gn/T/ipykernel_57464/2322077122.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_no_duplicates['Age'] = df_no_duplicates['Age'].astype(dtype=int)
/var/folders/mf/gw2nsdmn2qjcnj0gsj8sd1200000gn/T/ipykernel_57464/2322077122.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_no_duplicates['Salary'] = df_no_duplicates['Salary'].astype(dtype=int)

      Name  Age  Salary
0    Alice   25   50000
3    David   22   52000
4      Eve   28   58000
8   Hannah   35   70000
9      Ivy   29   65000
10    Jack   24   48000

### Normalization for Numeric Columns

The next step would be to normalize the columns from the dataset that are considered to be numerical.

In [9]:
scaler = MinMaxScaler() # use MinMaxScaler
df_no_duplicates[['Age', 'Salary']] = scaler.fit_transform(df_no_duplicates[['Age', 'Salary']])
df_no_duplicates

/var/folders/mf/gw2nsdmn2qjcnj0gsj8sd1200000gn/T/ipykernel_57464/594861902.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_no_duplicates[['Age', 'Salary']] = scaler.fit_transform(df_no_duplicates[['Age', 'Salary']])

      Name       Age    Salary
0    Alice  0.230769  0.090909
3    David  0.000000  0.181818
4      Eve  0.461538  0.454545
8   Hannah  1.000000  1.000000
9      Ivy  0.538462  0.772727
10    Jack  0.153846  0.000000

### Save to `cleaned_data.csv`

Now, let's convert the DataFrame back to a csv file.

In [10]:
df_no_duplicates.to_csv("cleaned_data.csv")